{"name": "Property Tax", "all_day": false, "start_date": "2019-02-06T14:00:00+00:00", "end_date": "", "status": "confirmed", "classification": "event", "description": "", "location": {"name": "E1.012 (Hearing Room) ", "note": "", "coordinates": null}, "media": [], "documents": [], "links": [], "participants": [{"name": "Property Tax", "entity_type": "committee", "note": "host", "committee_id": "~{\"name\": \"Property Tax\"}"}, {"name": "Senator Paul Bettencourt", "entity_type": "legislator", "note": "chair", "legislator_id": "~{\"name\": \"Senator Paul Bettencourt\"}"}], "agenda": [{"description": "Bill up for discussion", "classification": [], "related_entities": [{"name": "SB 2", "entity_type": "bill", "note": "consideration", "bill_id": "~{\"identifier\": \"SB 2\"}"}], "subjects": [], "media": [], "notes": [], "order": "0", "extras": {}}, {"description": "SENATE NOTICE OF PUBLIC HEARING COMMITTEE: Property Tax TIME & DATE: 8:00 AM, Wednesday, February 6, 2019 PLACE: E1.012 (Hearing Room) CHAIR: Senator Paul Bettencourt The committee will organize, adopt rules, discuss schedule, and consider the following: SB 2 Bettencourt | et al. Relating to ad valorem taxation. Witness registration for ORAL testimony will close at 3pm. However, you may register a position or provide written testimony only at any point during the hearing. Public Testimony: (will start no earlier than 12:30pm, or 30 minutes after the State of the Judiciary) Oral testimony is limited to 3 minutes. If providing written testimony, bring 20 copies, with your name on each copy, to the Assistant Clerk during the hearing. Oral testimony: register using the Senate kiosk located in the extension hallways or by going to http://swrs on public-capitol. Oral and written testimony: register using the Senate kiosk located in the extension hallways or by going to http://swrs on public-capitol and hold on to your documents until your name is called. Position only: register using the Senate kiosk located in the extension hallways or by going to http://swrs on public-capitol. Written testimony only: register your position using the Senate kiosk and submit 20 copies, with your name on each copy, to the Assistant Clerk, during the hearing.", "classification": [], "related_entities": [], "subjects": [], "media": [], "notes": [], "order": "1", "extras": {}}], "sources": [{"url": "https://capitol.texas.gov/tlodocs/86R/schedules/html/C5862019020608001.HTM", "note": ""}], "extras": {}, "_id": "f16e1274-6e10-11e9-9a9c-8c705a93969c"}