{"name": "Finance", "all_day": false, "start_date": "2019-02-13T15:00:00+00:00", "end_date": "", "status": "confirmed", "classification": "event", "description": "", "location": {"name": "E1.036 (Finance Room) ", "note": "", "coordinates": null}, "media": [], "documents": [], "links": [], "participants": [{"name": "Finance", "entity_type": "committee", "note": "host", "committee_id": "~{\"name\": \"Finance\"}"}, {"name": "Senator Jane Nelson", "entity_type": "legislator", "note": "chair", "legislator_id": "~{\"name\": \"Senator Jane Nelson\"}"}], "agenda": [{"description": "Bill up for discussion", "classification": [], "related_entities": [{"name": "SB 1", "entity_type": "bill", "note": "consideration", "bill_id": "~{\"identifier\": \"SB 1\"}"}], "subjects": [], "media": [], "notes": [], "order": "0", "extras": {}}, {"description": "** REVISION ** SENATE NOTICE OF PUBLIC HEARING COMMITTEE: Finance TIME & DATE: 9:00 AM, Wednesday, February 13, 2019 PLACE: E1.036 (Finance Room) CHAIR: Senator Jane Nelson Any unfinished business will be moved to a later date, to be determined. Invited Testimony: Any supporting written materials for the hearing must be provided to the Senate Finance Committee (SFC) 2 full business days before your scheduled hearing day. Please submit 50 copies to the SFC, and 6 copies to the LBB. The hearing schedule is subject to change. Agencies should consult the postings regularly and maintain contact with SFC staff. Public Testimony: Oral testimony is limited to 3 minutes. If providing written testimony, bring 40 copies, with your name on each copy, to the Assistant Clerk during the hearing. · Oral testimony: fill out a paper witness card and submit to the Assistant Clerk. · Oral and written testimony: fill out a paper witness card and hold on to your documents until your name is called. · Position only: register using the Senate kiosk located in the extension hallways or by going to http://swrs on public-capitol. · Written testimony only: register your position using the Senate kiosk then bring 40 copies, with your name on each copy, to the Assistant Clerk, during the hearing. The afternoon hearing will reconvene 30 minutes after adjournment of the Senate. LBB presentation documents can be found at: http://www.lbb.state.tx.us/Legislative_Session.aspx?Session=86 To consider the following: SB 1 Nelson General Appropriations Bill. Article III - Education Texas Tech University System Administration · Angelo State University · Texas Tech University Texas Tech University Health Sciences Center Texas Tech University Health Sciences Center at El Paso Baylor College of Medicine University of Texas System Administration · The University of Texas at Arlington · The University of Texas at Austin · The University of Texas at Dallas · The University of Texas at El Paso · The University of Texas at Permian Basin · The University of Texas at Rio Grande Valley · The University of Texas at Tyler · The University of Texas at San Antonio University of Texas MD Anderson Cancer Center University of Texas Southwestern Medical Center University of Texas Medical Branch at Galveston University of Texas Health Science Center at Houston University of Texas Health Science Center at San Antonio University of Texas Health Science Center at Tyler University of Houston System Administration · University of Houston · University of Houston- Downtown · University of Houston- Clear Lake · University of Houston- Victoria Public Community/Junior Colleges Texas State Technical College System and Administration · Texas State Technical College- Harlingen · Texas State Technical College- West Texas · Texas State Technical College- Marshall · Texas State Technical College- Waco · Texas State Technical College- Fort Bend · Texas State Technical College- North Texas Special Provisions Relating Only to Components of Texas State Technical College Special Provisions Relating Only to State Agencies of Higher Education Article IX - Special Provisions ** See Committee Coordinator for previous versions of the schedule **", "classification": [], "related_entities": [], "subjects": [], "media": [], "notes": [], "order": "1", "extras": {}}], "sources": [{"url": "https://capitol.texas.gov/tlodocs/86R/schedules/html/C5402019021309001.HTM", "note": ""}], "extras": {}, "_id": "db5053de-6e25-11e9-a257-8c705a93969c"}