{"name": "General Investigating", "all_day": false, "start_date": "2019-03-06T20:00:00+00:00", "end_date": "", "status": "confirmed", "classification": "event", "description": "", "location": {"name": "E1.010 ", "note": "", "coordinates": null}, "media": [], "documents": [], "links": [], "participants": [{"name": "General Investigating", "entity_type": "committee", "note": "host", "committee_id": "~{\"name\": \"General Investigating\"}"}, {"name": "Rep. Morgan Meyer", "entity_type": "legislator", "note": "chair", "legislator_id": "~{\"name\": \"Rep. Morgan Meyer\"}"}], "agenda": [{"description": "HOUSE OF REPRESENTATIVES NOTICE OF PUBLIC HEARING COMMITTEE: General Investigating TIME & DATE: 2:00 PM or upon final adjourn./recess or bill referral if permission granted Wednesday, March 6, 2019 PLACE: E1.010 CHAIR: Rep. Morgan Meyer *Public testimony may be limited to five (5) minutes per person* This will be an organizational meeting to consider committee rules and invited testimony. Public testimony may be taken on the committee's rules. A copy of the committee rules are available from the committee clerk upon request. If you intend to testify, please register using the electronic witness affirmation form, which will be available at any registration kiosk located throughout the Capitol Extension. The committee may enter into an executive session to consider any matter authorized to be considered in an executive session under Subchapter B, Chapter 301, Government Code, the Rules of the House of Representatives, the Housekeeping Resolution, and the committee\u0092s rules. NOTICE OF ASSISTANCE AT PUBLIC MEETINGS Persons with disabilities who plan to attend this meeting and who may need assistance, such as a sign language interpreter, are requested to contact Stacey Nicchio at (512) 463-0850, 72 hours prior to the meeting so that appropriate arrangements can be made.", "classification": [], "related_entities": [], "subjects": [], "media": [], "notes": [], "order": "0", "extras": {}}], "sources": [{"url": "https://capitol.texas.gov/tlodocs/86R/schedules/html/C2802019030614001.HTM", "note": ""}], "extras": {}, "_id": "b0ef3e8e-6e11-11e9-9a9c-8c705a93969c"}