{"name": "Homeland Security & Public Safety", "all_day": false, "start_date": "2019-04-05T15:30:00+00:00", "end_date": "", "status": "confirmed", "classification": "event", "description": "", "location": {"name": "E1.030 ", "note": "", "coordinates": null}, "media": [], "documents": [], "links": [], "participants": [{"name": "Homeland Security & Public Safety", "entity_type": "committee", "note": "host", "committee_id": "~{\"name\": \"Homeland Security & Public Safety\"}"}, {"name": "Rep. Poncho Nevárez", "entity_type": "legislator", "note": "chair", "legislator_id": "~{\"name\": \"Rep. Poncho Nev\\u00e1rez\"}"}], "agenda": [{"description": "** REVISION ** HOUSE OF REPRESENTATIVES NOTICE OF PUBLIC HEARING COMMITTEE: Homeland Security & Public Safety TIME & DATE: 10:30 AM or upon final adjourn./recess Friday, April 5, 2019 PLACE: E1.030 CHAIR: Rep. Poncho Nevárez The Committee will meet jointly with the House Committee on Environmental Regulation to hear invited testimony on the following: The ITC incident in Deer Park, Texas. The intent of this hearing is to be an informational briefing only. The scope is limited because the ITC facility is classified as an \"ongoing response\" and we did not want to pull resources that could otherwise be used in that effort. In the coming months, the committee will hold additional hearings to fully investigate this matter. At that time, there will be opportunity for more testimony and to hear from all those involved in the response, assessment and remediation. Both committees are aware of the public's desire for answers and is committed to investigating this matter fully. We are also committed to hearing community testimony at the next hearing. All members of the committees offer our sympathies to those affected. We also wish to recognize the bravery and diligence of the first responders who are responding to this incident. ** See Committee Coordinator for previous versions ** of the schedule, if applicable. NOTICE OF ASSISTANCE AT PUBLIC MEETINGS Persons with disabilities who plan to attend this meeting and who may need assistance, such as a sign language interpreter, are requested to contact Stacey Nicchio at (512) 463-0850, 72 hours prior to the meeting so that appropriate arrangements can be made.", "classification": [], "related_entities": [], "subjects": [], "media": [], "notes": [], "order": "0", "extras": {}}], "sources": [{"url": "https://capitol.texas.gov/tlodocs/86R/schedules/html/C4202019040510301.HTM", "note": ""}], "extras": {}, "_id": "ed2da0ce-6e26-11e9-a257-8c705a93969c"}