{"name": "Finance", "all_day": false, "start_date": "2019-01-28T16:00:00+00:00", "end_date": "", "status": "confirmed", "classification": "event", "description": "", "location": {"name": "E1.036 (Finance Room) ", "note": "", "coordinates": null}, "media": [], "documents": [], "links": [], "participants": [{"name": "Finance", "entity_type": "committee", "note": "host", "committee_id": "~{\"name\": \"Finance\"}"}, {"name": "Senator Jane Nelson", "entity_type": "legislator", "note": "chair", "legislator_id": "~{\"name\": \"Senator Jane Nelson\"}"}], "agenda": [{"description": "Bill up for discussion", "classification": [], "related_entities": [{"name": "SB 1", "entity_type": "bill", "note": "consideration", "bill_id": "~{\"identifier\": \"SB 1\"}"}], "subjects": [], "media": [], "notes": [], "order": "0", "extras": {}}, {"description": "SENATE NOTICE OF PUBLIC HEARING COMMITTEE: Finance TIME & DATE: 10:00 AM, Monday, January 28, 2019 PLACE: E1.036 (Finance Room) CHAIR: Senator Jane Nelson Any unfinished business will be moved to a later date, to be determined. Invited Testimony: Any supporting written materials for the hearing must be provided to the Senate Finance Committee (SFC) 2 full business days before your scheduled hearing day. Please submit 50 copies to the SFC, and 6 copies to the LBB. The hearing schedule is subject to change. Agencies should consult the postings regularly and maintain contact with SFC staff. Public Testimony: Oral testimony is limited to 3 minutes. If providing written testimony, bring 40 copies, with your name on each copy, to the Assistant Clerk during the hearing. Oral testimony: fill out a paper witness card and submit to the Assistant Clerk. Oral and written testimony: fill out a paper witness card and hold on to your documents until your name is called. Position only: register using the Senate kiosk located in the extension hallways or by going to http://swrs on public-capitol. Written testimony only: register your position using the Senate kiosk then bring 40 copies, with your name on each copy, to the Assistant Clerk, during the hearing. The afternoon hearing will reconvene 30 minutes after adjournment of the Senate. LBB presentation documents can be found at: http://www.lbb.state.tx.us/Legislative_Session.aspx?Session=86 To consider the following: SB 1 Nelson General Appropriations Bill. Article V - Public Safety and Criminal Justice Department of Public Safety Juvenile Justice Department Department of Criminal Justice Commission on Jail Standards Board of Pardons and Paroles Military Department Texas Alcoholic Beverage Commission Commission on Fire Protection Commission on Law Enforcement Special Provisions Relating to Public Safety and Criminal Justice Agencies", "classification": [], "related_entities": [], "subjects": [], "media": [], "notes": [], "order": "1", "extras": {}}], "sources": [{"url": "https://capitol.texas.gov/tlodocs/86R/schedules/html/C5402019012810001.HTM", "note": ""}], "extras": {}, "_id": "b792560a-6e10-11e9-9a9c-8c705a93969c"}