{"name": "Nominations", "all_day": false, "start_date": "2019-02-14T15:00:00+00:00", "end_date": "", "status": "confirmed", "classification": "event", "description": "", "location": {"name": "E1.016 (Hearing Room)", "note": "", "coordinates": null}, "media": [], "documents": [], "links": [], "participants": [{"name": "Nominations", "entity_type": "committee", "note": "host", "committee_id": "~{\"name\": \"Nominations\"}"}, {"name": "Senator Dawn Buckingham", "entity_type": "legislator", "note": "chair", "legislator_id": "~{\"name\": \"Senator Dawn Buckingham\"}"}], "agenda": [{"description": "SENATE NOTICE OF PUBLIC HEARING COMMITTEE: Nominations TIME & DATE: 9:00 AM Thursday, February 14, 2019 PLACE: E1.016 (Hearing Room) CHAIR: Senator Dawn Buckingham __________________________________________________________________________________ To consider the following: Pending Business from the 2/7/19 meeting as well as the posted agenda. The following nominees will appear: Texas Military Department Tracy Ray Norris Appointed 01-01-19 for a Buckingham Travis County term to expire 02-01-20 Commissioner of the Department of Family and Protective Services Henry Lee Whitman Appointed 03-01-18 for a Zaffirini Wilson County term to expire 09-01-19 Commissioner of Insurance Kent C. Sullivan Appointed 02-06-19 for a Watson Travis County term to expire 02-01-21 Office of State-Federal Relations Thomas W. Hambrick Appointed 01-30-19 for a Miles Harris County term to expire Executive Commissioner of the Health and Human Services Commission Courtney N. Phillips Appointed 02-06-19 for a Watson Travis County term to expire 02-01-21 Texas Commission on Environmental Quality Emily Kathryn Lindley Appointed 08-20-18 for a Watson Travis County term to expire 08-31-23 Public Utility Commission of Texas Shelly Lyn Botkin Appointed 06-11-18 for a Watson Travis County term to expire 09-01-19 Arthur Cleveland D'Andrea Appointed 11-14-17 for a Campbell Travis County term to expire 09-01-23 DeAnn Thomason Walker Appointed 09-20-17 for a Campbell Travis County term to expire 09-01-21 The following nominees will not appear: 51st Judicial District Court, Coke, Irion, Schleicher, Sterling, and Tom Green Counties Carmen Symes Dusek Appointed 11-12-18 for a Perry Tom Green County term to expire 12-31-20 76th Judicial District Court, Camp, Morris, and Titus Counties Angela Hammonds Saucier Appointed 01-24-19 for a Hughes Camp County term to expire 12-31-20 200th Judicial District Court, Travis County Dustin Mark Howell Appointed 01-07-19 for a Watson Travis County term to expire 12-31-20 213th Judicial District Court, Tarrant County Christopher Robert Wolfe Appointed 10-24-18 for a Powell Tarrant County term to expire 12-31-20 254th Judicial District Court, Dallas County Ashley Elizabeth Wysocki Appointed 01-28-19 for a Johnson Dallas County term to expire 12-31-20 453rd Judicial District Court, Hays County David Crawford Junkin Appointed 11-30-18 for a Campbell Hays County term to expire 12-31-20 462nd Judicial District Court, Denton County Lee Ann Breading Appointed 01-01-19 for a Fallon Denton County term to expire 12-31-20 464th Judicial District Court, Hidalgo County Jaime Eduardo Tijerina Appointed 01-28-19 for a Hinojosa Hidalgo County term to expire 12-31-20 Administrative Judicial Region, First Raymond G. Wheless Appointed 03-16-18 for a Paxton Collin County term to expire 04-08-22 Administrative Judicial Region, Second Olen U. Underwood Appointed 05-07-18 for a Nichols Montgomery County term to expire 05-20-22 Administrative Judicial Region, Third Billy Ray Stubblefield Appointed 10-09-18 for a Schwertner Williamson County term to expire 10-31-22 Administrative Judicial Region, Fourth Sidney Lee Harle Appointed 08-17-17 for a Campbell Bexar County term to expire 08-20-21 Administrative Judicial Region, Eighth David Lattimore Evans Appointed 06-20-18 for a Powell Tarrant County term to expire 06-20-22 Administrative Judicial Region, Tenth Fredrick Charles Appointed 02-14-18 for a Hughes Gregg County term to expire 02-19-22 Administrative Judicial Region, Eleventh Susan Baetz Brown Appointed 03-07-18 for a Huffman Harris County term to expire 04-08-22 Texas Mutual Insurance Company Board of Directors Ronald Ellis Simmons Appointed 01-29-19 for a Nelson Denton County term to expire 07-01-23 __________________________________________________________________________________", "classification": [], "related_entities": [], "subjects": [], "media": [], "notes": [], "order": "0", "extras": {}}], "sources": [{"url": "https://capitol.texas.gov/tlodocs/86R/schedules/html/C5722019021409001.HTM", "note": ""}], "extras": {}, "_id": "106af592-6e26-11e9-a257-8c705a93969c"}