{"name": "José Rodríguez", "other_names": [], "identifiers": [], "gender": "", "birth_date": "", "death_date": "", "image": "https://senate.texas.gov/members/d29/img/headshot.jpg", "summary": "", "biography": "José Rodríguez was elected in 2010 to represent Texas Senate District 29 (SD 29), which includes the counties of El Paso, Hudspeth, Culberson, Jeff Davis, and Presidio. He represents both urban and rural constituencies, and more than 350 miles of the Texas-Mexico border. \r \r Prior to his election to the Texas Senate, Sen. Rodríguez served as the El Paso County Attorney for 17 years, where he established an unparalleled record of achievement, improving public safety, enhancing legal services to protect vulnerable citizens, promoting education, increasing County revenues and funding for jobs and economic development, and strengthening community health and environmental quality.\r \r That level of service to his community continues today as a member of the Texas State Senate. Sen. Rodríguez is a staunch advocate for those in need. He has proven himself an effective voice for SD 29, passing more than 200 bills during his four sessions in the Texas Senate. This includes legislation addressing education, health care, economic development, renewable energy, criminal justice reform, public safety and the courts, ethics and government transparency, and veterans. Of note, Sen. Rodríguez passed legislation transforming the Texas Tech University Health Sciences Center at El Paso from a branch of the Lubbock-based health sciences center to an independent, standalone university component of the Texas Tech University System as well as a series of bills to address cheating and accountability in standardized testing in our schools. \r \r His hard work and tenacity on the Senate floor have gained him numerous accolades, including being named \"Freshman MVP\" by  , \"Legislative Hero\" by Texas Access to Justice Foundation, \"Best of Senate\" by the Combined Law Enforcement Association of Texas, \"Advocate of the Year, Elected Official\" by the Texas Association for Education of Young Children, \"Texas Women's Health Champion\" by the American Congress of Obstetricians and Gynecologists, \"Champion of Equality\" by Equality Texas, \"Legislator of the Year\" by the Family Law Foundation, \"Senate Legislator of the Year\" by Texas Nurse Practitioners, and the \"2015 TABE Joe J. Bernal Community Service Honoree\" by the Texas Association for Bilingual Education. \r \r Sen. Rodríguez currently serves as the Chairman of the Texas Senate Democratic Caucus (SDC), and as a member of the Senate Committees on Natural Resources & Economic Development, Transportation, Veteran Affairs & Border Security, and Agriculture, Water & Rural Affairs. Prior to leading the SDC, he served as the Chairman of the Texas Senate Hispanic Caucus for nearly two years. \r \r In addition, Sen. Rodríguez serves as one of only five U.S. Presidential appointees on the 10-member Board of Directors of the Border Environment Cooperation Commission-North American Development Bank (BECC-NADB), which has distributed $2.6 billion in loans and grants for over 200 BECC-certified infrastructure projects on both sides of the border.\r \r The son of migrant farm workers, Sen. Rodríguez was born in Alice, Texas. From an early age, he worked in fields throughout the country to help support a family of nine. The first in his family to attend college, he received his undergraduate degree from Pan American University in 1971 and his law degree from the National Law Center at George Washington University in 1974. Since 1983, Sen. Rodríguez and his family have made their home in El Paso, where they have been deeply involved in civic, economic development, and human rights activities.", "national_identity": "", "contact_details": [{"type": "address", "value": "Room 3E.18  The Honorable José Rodríguez P.O. Box 12068 Capitol Station Austin, TX 78711", "note": "Capitol Address"}, {"type": "voice", "value": "(512) 463-0129", "note": "Capitol Address"}, {"type": "address", "value": "100 N. Ochoa, Suite A El Paso, TX 79901", "note": "District Address"}, {"type": "voice", "value": "(915) 351-3500", "note": "District Address"}, {"type": "address", "value": "206 S.E. 8th Street, Suite 201 Fabens, TX 79838", "note": "District Address"}, {"type": "voice", "value": "(915) 765-2000", "note": "District Address"}, {"type": "address", "value": "300 W. Columbia St., Room 102 Marfa, TX 79843", "note": "District Address"}, {"type": "voice", "value": "(432) 729-4800", "note": "District Address"}], "links": [{"note": "", "url": "https://senate.texas.gov/member.php?d=29"}], "sources": [{"url": "https://senate.texas.gov/member.php?d=29", "note": ""}], "extras": {}, "_id": "4376d160-6de3-11e9-9a9c-8c705a93969c"}