{"legislative_session": "2019", "identifier": "HB 1680", "title": "Certificate of public need; changes to Medical Care Facilities Certificate of Public Need Program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Administration of Government", "Health", "Study Commissions, Committees and Reports"], "abstracts": [{"note": "summary", "abstract": "Makes changes to the Medical Care Facilities Certificate of Public Need Program. The bill (i) removes specialized centers or clinics or that portion of a physician's office developed for the provision of lithotripsy, magnetic source imaging, or nuclear medicine imaging from the list of reviewable medical care facilities; (ii) provides that establishment of a medical care facility to replace an existing medical care facility with the same primary service area does not constitute a project; (iii) removes introduction into an existing medical care facility of any new lithotripsy, magnetic source imaging, or obstetrical service that the facility has never provided or has not provided in the previous 12 months and addition by an existing medical care facility of any medical equipment for the provision of lithotripsy and magnetic source imaging (MSI) from the definition of project; (iv) removes additions of operating rooms at an existing hospital or at any medical care facility when each operating room to be added will be utilized solely for surgical procedures for which the average number of such surgeries performed in hospitals in the Commonwealth during the previous three years was less than 0.1 percent of the total number of all surgeries performed in the Commonwealth during the same period from the list of projects for which a certificate is required; (v) eliminates the requirement for a certificate of public need for certain projects involving mental hospitals or psychiatric hospitals and intermediate care facilities established primarily for the medical, psychiatric, or psychological treatment and rehabilitation of individuals with substance abuse; (vi) adds any facility that has common ownership with an affiliated licensed hospital located within 35 miles of the facility and that includes, as part of the facility, a dedicated emergency department as defined in 42 C.F.R. § 489.24(b) that is subject to the requirements of the federal Emergency Medical Treatment and Labor Act to the list of medical care facilities for which a certificate of public need is required; (vii) limits the definition of \"project\" to those undertaken by a medical care facility other than a medical care facility that has common ownership with an affiliated licensed hospital located within 35 miles of the facility and that includes, as part of the facility, a dedicated emergency department as defined in 42 C.F.R. § 489.24(b) that is subject to the requirements of the federal Emergency Medical Treatment and Labor Act when the project is undertaken within 10 miles of a general hospital and projects undertaken by a medical care facility that has common ownership with an affiliated licensed hospital located within 35 miles of the facility and that includes, as part of the facility, a dedicated emergency department as defined in 42 C.F.R. § 489.24(b) that is subject to the requirements of the federal Emergency Medical Treatment and Labor Act regardless of where the project is undertaken; (viii) creates a new process for registration of projects exempted from the definition of project by the bill; (ix) establishes an expedited 45-day review process for applicants for projects determined to be uncontested or to present limited health planning impacts; (x) renames the State Medical Facilities Plan as the State Health Services Plan and establishes a State Health Services Plan Advisory Council to provide recommendations related to the content of the State Health Services Plan; (xi) clarifies the content of the application for a certificate; (xii) reduces the timeline for a person to be made party to the case for good cause from 80 calendar days to four days following completion of the review and submission of recommendations related to an application; (xiii) requires the State Health Commissioner to approve an application that is consistent with the State Health Services Plan unless the State Health Commissioner determines that, upon consideration of certain factors, the application should not be approved; and (xiv) makes review by a regional health planning agency optional for the application.", "date": ""}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Prefiled and ordered printed; offered 01/09/19 19100914D", "date": "2018-12-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [], "extras": {}}, {"description": "Referred to Committee on Health, Welfare and Institutions", "date": "2018-12-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [], "extras": {}}, {"description": "Assigned HWI sub: Subcommittee #3", "date": "2019-01-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [], "extras": {}}, {"description": "Tabled in Health, Welfare and Institutions by voice vote", "date": "2019-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": [], "extras": {}}], "sponsorships": [{"name": "Robert D. Orrock, Sr.", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Robert D. Orrock, Sr.\"}", "organization_id": null}, {"name": "Richard P. Bell", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Richard P. Bell\"}", "organization_id": null}, {"name": "Kathy J. Byron", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Kathy J. Byron\"}", "organization_id": null}, {"name": "Hyland F. \"Buddy\" Fowler, Jr.", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Hyland F. \\\"Buddy\\\" Fowler, Jr.\"}", "organization_id": null}, {"name": "Christopher T. Head", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Christopher T. Head\"}", "organization_id": null}, {"name": "Jason S. Miyares", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Jason S. Miyares\"}", "organization_id": null}, {"name": "Charles D. Poindexter", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Charles D. Poindexter\"}", "organization_id": null}, {"name": "Roxann L. Robinson", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Roxann L. Robinson\"}", "organization_id": null}, {"name": "Robert M. \"Bob\" Thomas, Jr.", "classification": "cosponsor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Robert M. \\\"Bob\\\" Thomas, Jr.\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "House: Prefiled and ordered printed; offered 01/09/19 19100914D", "links": [{"url": "http://lis.virginia.gov/cgi-bin/legp604.exe?191+ful+HB1680", "media_type": "text/html", "text": ""}], "date": "2018-12-05"}], "documents": [], "sources": [{"url": "http://lis.virginia.gov/cgi-bin/legp604.exe?191+sum+HB1680", "note": ""}], "extras": {}, "_id": "53366e62-6e15-11e9-8704-8c705a93969c"}