{"legislative_session": "2019", "identifier": "HB 1638", "title": "Virginia Lottery; regulation of sports betting, creation of certain Funds, etc.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Computer Services and Uses", "Gambling, Lotteries, Etc.", "Taxation", "Trade and Commerce"], "abstracts": [{"note": "summary", "abstract": "Directs the Virginia Lottery (the Lottery) to regulate sports betting. Before administering a sports betting operation, an entity is required to apply for a three-year permit and pay an application fee of $250,000. Permit holders must apply for renewal of a permit every three years, which includes a renewal fee of $200,000. The Director may issue up to five permits at one time.Under the provisions of the bill, betting on Virginia college sports and youth sports is prohibited, and betting on professional sports and other college sports is allowed. The bill prohibits betting by Lottery employees, participants in athletic events on which the bet is placed, and persons under age 21. The penalty for engaging in prohibited betting is a Class 1 misdemeanor.The bill directs the Lottery to establish a voluntary exclusion program, which would allow individuals to request that the Lottery exclude them from buying lottery tickets or participating in sports betting. The bill imposes a 15% tax on a permit holder's adjusted gross revenue, defined in the bill. The Lottery would retain 2.5% of the tax revenue to defray its costs of administering the program. The bill creates the Problem Gambling Treatment and Support Fund, administered by the Department of Behavioral Health and Developmental Services. The Fund would be used to provide counseling to compulsive gamblers, implement problem gambling treatment and prevention programs, and provide grants to organizations that assist problem gamblers. The Fund would be funded by 2.5% of the revenue generated from sports betting. The remaining 95% of tax revenue generated from sports betting accrues to the Major Research Project Subfund, a subfund of the Virginia Research Investment Fund created by the bill, to be used to fund grants or loans of at least $10 million. The bill requires the MEI Project Approval Commission to review grants or loans from the Subfund. The bill authorizes the Lottery to sell tickets over the Internet. Under current law, it is prohibited from doing so.", "date": ""}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Prefiled and ordered printed; offered 01/09/19 19100097D", "date": "2018-11-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": [], "extras": {}}, {"description": "Referred to Committee on Rules", "date": "2018-11-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [], "extras": {}}], "sponsorships": [{"name": "Mark D. Sickles", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Mark D. Sickles\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "House: Prefiled and ordered printed; offered 01/09/19 19100097D", "links": [{"url": "http://lis.virginia.gov/cgi-bin/legp604.exe?191+ful+HB1638", "media_type": "text/html", "text": ""}], "date": "2018-11-20"}], "documents": [], "sources": [{"url": "http://lis.virginia.gov/cgi-bin/legp604.exe?191+sum+HB1638", "note": ""}], "extras": {}, "_id": "7d583bf4-6e14-11e9-8704-8c705a93969c"}